import csv
import datetime
import icalendar

COURSE_INFO = [["计算机网络", "02/24/2020 10:20:00",  "02/24/2020 11:55:00", 16, "二教110", "刘梦娟", 0],
                ["计算机网络", "02/26/2020 10:20:00",  "02/26/2020 11:55:00", 16, "二教110", "刘梦娟", 0],
                ["计算机网络", "02/28/2020 10:20:00",  "02/28/2020 11:55:00", 16, "二教110", "刘梦娟", 0],
                ["乒乓球", "02/25/2020 10:20:00", "02/25/2020 11:55:00", 16, "体育馆", "谢蓉", 0],
                ["操作系统基础", "02/26/2020 14:30:00", "02/26/2020 16:05:00", 16, "二教101", "陈佳", 0],
                ["操作系统基础", "02/28/2020 08:30:00", "02/28/2020 10:05:00", 16, "二教101", "陈佳", 0],
                ["嵌入式系统设计", "02/24/2020 14:30:00", "02/24/2020 16:05:00", 8, "二教215", "廖勇", 0],
                ["嵌入式系统设计", "02/25/2020 14:30:00", "02/25/2020 16:05:00", 8, "二教215", "廖勇", 0],
                ["嵌入式系统设计", "02/27/2020 14:30:00", "02/27/2020 16:05:00", 8, "二教215", "廖勇", 0],
                ["商务职场英语", "02/27/2020 10:20:00", "02/27/2020 11:55:00", 17, "二教401", "杜佳洋", 0],
                ["数据库原理及应用", "02/25/2020 19:30:00", "02/25/2020 21:55:00", 16, "二教214", "胡成华", 0],
                ["疯狂的电池", "02/24/2020 19:30:00", "02/24/2020 22:45:00", 16, "二教401", "王刚,杨文君,谢小东,汪新艳", 0]
                ]


_COURSE_INFO = [["商务职场英语", "02/27/2020 10:20:00", "02/27/2020 11:55:00", 17, "二教401", "杜佳洋", 0],
               ["疯狂的电池", "02/24/2020 19:30:00", "02/24/2020 22:45:00", 16, "二教401", "王刚,杨文君,谢小东,汪新艳", 0],
               ["数据库原理及应用", "02/28/2020 19:30:00", "02/28/2020 21:55:00", 16, "二教106", "陈安龙", 0],
               ["操作系统基础", "02/24/2020 14:30:00", "02/24/2020 16:05:00", 16, "二教205", "任立勇", 0],
               ["操作系统基础", "02/26/2020 08:30:00", "02/26/2020 10:05:00", 16, "二教205", "任立勇", 0],
               ["器械健身", "02/25/2020 14:30:00", "02/25/2020 16:05:00", 16, "体育馆", "周川", 0],
               ["计算机动画", "02/28/2020 10:20:00",  "02/28/2020 11:55:00", 16, "二教107", "吴佳", 0],
               ["计算机动画", "02/26/2020 10:20:00",  "02/26/2020 11:55:00", 16, "二教107", "吴佳", 1],
               ["数字娱乐软件架构", "02/26/2020 10:20:00",  "02/26/2020 11:55:00", 16, "二教205", "何明耘", 2],
               ["数字娱乐软件架构", "02/28/2020 14:30:00",  "02/28/2020 16:05:00", 16, "二教205", "何明耘", 0],
               ["美学基础", "02/27/2020 14:30:00",  "02/27/2020 16:05:00", 16, "二教104", "郝云超", 0],
               ["计算机网络", "02/24/2020 08:30:00", "02/24/2020 10:05:00", 16, "", "", 0],
               ["计算机网络", "02/26/2020 14:30:00", "02/26/2020 16:05:00", 16, "", "", 0],
               ["计算机网络", "02/28/2020 08:30:00", "02/28/2020 10:05:00", 16, "", "", 0]
               ]


def main():
    calendar = icalendar.Calendar()
    calendar.add('version', '2.0')
    calendar.add('PRODID', '-//Add Course//kelo.cetacis.dev//')
    for i in range(0, len(COURSE_INFO)):
        for x in range(0, COURSE_INFO[i][3]):
            if COURSE_INFO[i][6] == 2:
                if x % 2 == 0:
                    continue
            elif COURSE_INFO[i][6] == 1:
                if x % 2 == 1:
                    continue
            event = icalendar.Event()
            start_date = datetime.datetime.strptime(COURSE_INFO[i][1], "%m/%d/%Y %H:%M:%S") + datetime.timedelta(days
                                                                                                                 =7 * x)
            end_data = datetime.datetime.strptime(COURSE_INFO[i][2], "%m/%d/%Y %H:%M:%S") + datetime.timedelta(days
                                                                                                               =7 * x)
            event.add('dtstart', start_date)
            event.add('dtend', end_data)
            event['summary'] = COURSE_INFO[i][5] + ' ' + COURSE_INFO[i][0]
            event['location'] = icalendar.vText(COURSE_INFO[i][4])
            event['TRANSP'] = icalendar.vText('OPAQUE')
            event['status'] = 'confirmed'
            calendar.add_component(event)
    with open('calendar.ics', 'wb') as file:
        file.write(calendar.to_ical())


if __name__ == '__main__':
    main()
